{
    "numpy": {
        "linspace": [
            {
                "name": "start",
                "type": "int",
                "default_value": "",
                "description": "The starting value of the sequence."
            },
            {
                "name": "stop",
                "type": "int",
                "default_value": "",
                "description": "The end value of the sequence, unless endpoint is set to False. In that case, the sequence consists of all but the last of num + 1 evenly spaced samples, so that stop is excluded. Note that the step size changes when endpoint is False."
            },
            {
                "name": "num",
                "type": "int",
                "default_value": "50",
                "description": "Number of samples to generate. Must be non-negative."
            },
            {   
                "name": "endpoint",
                "type": "bool",
                "default_value": "True",
                "description": "If True, stop is the last sample. Otherwise, it is not included."
            },
            {
                "name": "retstep",
                "type": "bool",
                "default_value": "False",
                "description": "If True, return (samples, step), where step is the spacing between samples."
            },
            {
                "name": "dtype",
                "type": "dtype",
                "default_value": "None",
                "description": "The type of the output array. If dtype is not given, the data type is inferred from start and stop. The inferred dtype will never be an integer; float is chosen even if the arguments would produce an array of integers."
            },
            {
                "name": "axis",
                "type": "int",
                "default_value": "0",
                "description": "The axis in the result to store the samples. Relevant only if start or stop are array-like."
            },
            {
                "name": "device",
                "type": "string",
                "default_value": "None",
                "description": "The device on which to place the created array."
            }
        ]
    },
    "pyplot": {
        "figure": [
            {
                "name": "num",
                "type": ["int", "str", "Figure", "SubFigure"],
                "default_value": "",
                "description": "A unique identifier for the figure. If a figure with that identifier already exists, this figure is made active and returned. An integer refers to the Figure.number attribute, a string refers to the figure label. If there is no figure with the identifier or num is not given, a new figure is created, made active and returned. If num is an int, it will be used for the Figure.number attribute, otherwise, an auto-generated integer value is used (starting at 1 and incremented for each new figure). If num is a string, the figure label and the window title is set to this value. If num is a SubFigure, its parent Figure is activated."
            },
            {
               "name": "figsize",
                "type": "(float, float)",
                "default_value": "[6.4, 4.8]",
                "description": "Width, height in inches."
            },
            {
                "name": "dpi",
                "type": "float",
                "default_value": "100.0",
                "description": "The resolution of the figure in dots-per-inch."
            },
            {
                "name": "facecolor",
                "type": "color",
                "default_value": "white",
                "description": "The background color."
            },
            {
                "name": "edgecolor",
                "type": "color",
                "default_value": "white",
                "description": "The border color."
            },
            {
                "name": "frameon",
                "type": "bool",
                "default_value": "True",
                "description": "If False, suppress drawing the figure frame."
            },
            {
                "name": "FigureClass",
                "type": "Figure",
                "default_value": "",
                "description": "If set, an instance of this subclass will be created, rather than a plain Figure"
            },
            {
                "name": "clear",
                "type": "bool",
                "default_value": "False",
                "description": "If True and the figure already exists, then it is cleared."
            },
            {
                "name": "layout",
                "type": "str",
                "default_value": "None",
                "description": "The layout mechanism for positioning of plot elements to avoid overlapping Axes decorations (labels, ticks, etc). One of {'constrained', 'compressed', 'tight', 'none', LayoutEngine, None}"
            }

        ]
    }
}